betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_flash_ex.h
/*-------------------------- APM32F40xxx/APM32F41xxx/APM32F411xx -----------------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) ||\
    defined(APM32F465xx) || defined(APM32F411xx)

#define FLASH_LATENCY_0                FLASH_ACCTRL_WAITP_0WS   /*!< FLASH Zero Latency cycle      */
#define FLASH_LATENCY_1                FLASH_ACCTRL_WAITP_1WS   /*!< FLASH One Latency cycle       */
#define FLASH_LATENCY_2                FLASH_ACCTRL_WAITP_2WS   /*!< FLASH Two Latency cycles      */
#define FLASH_LATENCY_3                FLASH_ACCTRL_WAITP_3WS   /*!< FLASH Three Latency cycles    */
#define FLASH_LATENCY_4                FLASH_ACCTRL_WAITP_4WS   /*!< FLASH Four Latency cycles     */
#define FLASH_LATENCY_5                FLASH_ACCTRL_WAITP_5WS   /*!< FLASH Five Latency cycles     */
#define FLASH_LATENCY_6                FLASH_ACCTRL_WAITP_6WS   /*!< FLASH Six Latency cycles      */
#define FLASH_LATENCY_7                FLASH_ACCTRL_WAITP_7WS   /*!< FLASH Seven Latency cycles    */
#elif defined (APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define FLASH_LATENCY_0                FLASH_ACCTRL_WAITP_0WS
#define FLASH_LATENCY_1                FLASH_ACCTRL_WAITP_1WS
#define FLASH_LATENCY_2                FLASH_ACCTRL_WAITP_2WS
#define FLASH_LATENCY_3                FLASH_ACCTRL_WAITP_3WS
#define FLASH_LATENCY_4                FLASH_ACCTRL_WAITP_4WS
#define FLASH_LATENCY_5                FLASH_ACCTRL_WAITP_5WS
#define FLASH_LATENCY_6                FLASH_ACCTRL_WAITP_6WS
#define FLASH_LATENCY_7                FLASH_ACCTRL_WAITP_7WS
#define FLASH_LATENCY_8                FLASH_ACCTRL_WAITP_8WS
#define FLASH_LATENCY_9                FLASH_ACCTRL_WAITP_9WS
#define FLASH_LATENCY_10               FLASH_ACCTRL_WAITP_10WS
#define FLASH_LATENCY_11               FLASH_ACCTRL_WAITP_11WS
#define FLASH_LATENCY_12               FLASH_ACCTRL_WAITP_12WS
#define FLASH_LATENCY_13               FLASH_ACCTRL_WAITP_13WS
#define FLASH_LATENCY_14               FLASH_ACCTRL_WAITP_14WS
#define FLASH_LATENCY_15               FLASH_ACCTRL_WAITP_15WS
#define FLASH_LATENCY_16               FLASH_ACCTRL_WAITP_16WS
#define FLASH_LATENCY_17               FLASH_ACCTRL_WAITP_17WS
#define FLASH_LATENCY_18               FLASH_ACCTRL_WAITP_18WS
#define FLASH_LATENCY_19               FLASH_ACCTRL_WAITP_19WS
#define FLASH_LATENCY_20               FLASH_ACCTRL_WAITP_20WS
#define FLASH_LATENCY_21               FLASH_ACCTRL_WAITP_21WS
#define FLASH_LATENCY_22               FLASH_ACCTRL_WAITP_22WS
#define FLASH_LATENCY_23               FLASH_ACCTRL_WAITP_23WS
#define FLASH_LATENCY_24               FLASH_ACCTRL_WAITP_24WS
#define FLASH_LATENCY_25               FLASH_ACCTRL_WAITP_25WS
#define FLASH_LATENCY_26               FLASH_ACCTRL_WAITP_26WS
#define FLASH_LATENCY_27               FLASH_ACCTRL_WAITP_27WS
#define FLASH_LATENCY_28               FLASH_ACCTRL_WAITP_28WS
#define FLASH_LATENCY_29               FLASH_ACCTRL_WAITP_29WS
#define FLASH_LATENCY_30               FLASH_ACCTRL_WAITP_30WS
#define FLASH_LATENCY_31               FLASH_ACCTRL_WAITP_31WS
#define FLASH_LATENCY_32               FLASH_ACCTRL_WAITP_32WS
#define FLASH_LATENCY_33               FLASH_ACCTRL_WAITP_33WS
#define FLASH_LATENCY_34               FLASH_ACCTRL_WAITP_34WS
#define FLASH_LATENCY_35               FLASH_ACCTRL_WAITP_35WS
#define FLASH_LATENCY_36               FLASH_ACCTRL_WAITP_36WS
#define FLASH_LATENCY_37               FLASH_ACCTRL_WAITP_37WS
#define FLASH_LATENCY_38               FLASH_ACCTRL_WAITP_38WS
#define FLASH_LATENCY_39               FLASH_ACCTRL_WAITP_39WS
#define FLASH_LATENCY_40               FLASH_ACCTRL_WAITP_40WS
#define FLASH_LATENCY_41               FLASH_ACCTRL_WAITP_41WS
#define FLASH_LATENCY_42               FLASH_ACCTRL_WAITP_42WS
#define FLASH_LATENCY_43               FLASH_ACCTRL_WAITP_43WS
#define FLASH_LATENCY_44               FLASH_ACCTRL_WAITP_44WS
#define FLASH_LATENCY_45               FLASH_ACCTRL_WAITP_45WS
#define FLASH_LATENCY_46               FLASH_ACCTRL_WAITP_46WS
#define FLASH_LATENCY_47               FLASH_ACCTRL_WAITP_47WS
#define FLASH_LATENCY_48               FLASH_ACCTRL_WAITP_48WS
#define FLASH_LATENCY_49               FLASH_ACCTRL_WAITP_49WS
#define FLASH_LATENCY_50               FLASH_ACCTRL_WAITP_50WS
#define FLASH_LATENCY_51               FLASH_ACCTRL_WAITP_51WS
#define FLASH_LATENCY_52               FLASH_ACCTRL_WAITP_52WS
#define FLASH_LATENCY_53               FLASH_ACCTRL_WAITP_53WS
#define FLASH_LATENCY_54               FLASH_ACCTRL_WAITP_54WS
#define FLASH_LATENCY_55               FLASH_ACCTRL_WAITP_55WS
#define FLASH_LATENCY_56               FLASH_ACCTRL_WAITP_56WS
#define FLASH_LATENCY_57               FLASH_ACCTRL_WAITP_57WS
#define FLASH_LATENCY_58               FLASH_ACCTRL_WAITP_58WS
#define FLASH_LATENCY_59               FLASH_ACCTRL_WAITP_59WS
#define FLASH_LATENCY_60               FLASH_ACCTRL_WAITP_60WS
#define FLASH_LATENCY_61               FLASH_ACCTRL_WAITP_61WS
#define FLASH_LATENCY_62               FLASH_ACCTRL_WAITP_62WS
#define FLASH_LATENCY_63               FLASH_ACCTRL_WAITP_63WS
#define FLASH_LATENCY_64               FLASH_ACCTRL_WAITP_64WS
#define FLASH_LATENCY_65               FLASH_ACCTRL_WAITP_65WS
#define FLASH_LATENCY_66               FLASH_ACCTRL_WAITP_66WS
#define FLASH_LATENCY_67               FLASH_ACCTRL_WAITP_67WS
#define FLASH_LATENCY_68               FLASH_ACCTRL_WAITP_68WS
#define FLASH_LATENCY_69               FLASH_ACCTRL_WAITP_69WS
#define FLASH_LATENCY_70               FLASH_ACCTRL_WAITP_70WS
#define FLASH_LATENCY_71               FLASH_ACCTRL_WAITP_71WS
#define FLASH_LATENCY_72               FLASH_ACCTRL_WAITP_72WS
#define FLASH_LATENCY_73               FLASH_ACCTRL_WAITP_73WS
#define FLASH_LATENCY_74               FLASH_ACCTRL_WAITP_74WS
#define FLASH_LATENCY_75               FLASH_ACCTRL_WAITP_75WS
#define FLASH_LATENCY_76               FLASH_ACCTRL_WAITP_76WS
#define FLASH_LATENCY_77               FLASH_ACCTRL_WAITP_77WS
#define FLASH_LATENCY_78               FLASH_ACCTRL_WAITP_78WS
#define FLASH_LATENCY_79               FLASH_ACCTRL_WAITP_79WS
#define FLASH_LATENCY_80               FLASH_ACCTRL_WAITP_80WS
#define FLASH_LATENCY_81               FLASH_ACCTRL_WAITP_81WS
#define FLASH_LATENCY_82               FLASH_ACCTRL_WAITP_82WS
#define FLASH_LATENCY_83               FLASH_ACCTRL_WAITP_83WS
#define FLASH_LATENCY_84               FLASH_ACCTRL_WAITP_84WS
#define FLASH_LATENCY_85               FLASH_ACCTRL_WAITP_85WS
#define FLASH_LATENCY_86               FLASH_ACCTRL_WAITP_86WS
#define FLASH_LATENCY_87               FLASH_ACCTRL_WAITP_87WS
#define FLASH_LATENCY_88               FLASH_ACCTRL_WAITP_88WS
#define FLASH_LATENCY_89               FLASH_ACCTRL_WAITP_89WS
#define FLASH_LATENCY_90               FLASH_ACCTRL_WAITP_90WS
#define FLASH_LATENCY_91               FLASH_ACCTRL_WAITP_91WS
#define FLASH_LATENCY_92               FLASH_ACCTRL_WAITP_92WS
#define FLASH_LATENCY_93               FLASH_ACCTRL_WAITP_93WS
#define FLASH_LATENCY_94               FLASH_ACCTRL_WAITP_94WS
#define FLASH_LATENCY_95               FLASH_ACCTRL_WAITP_95WS
#define FLASH_LATENCY_96               FLASH_ACCTRL_WAITP_96WS
#define FLASH_LATENCY_97               FLASH_ACCTRL_WAITP_97WS
#define FLASH_LATENCY_98               FLASH_ACCTRL_WAITP_98WS
#define FLASH_LATENCY_99               FLASH_ACCTRL_WAITP_99WS
#define FLASH_LATENCY_100              FLASH_ACCTRL_WAITP_100WS
#define FLASH_LATENCY_101              FLASH_ACCTRL_WAITP_101WS
#define FLASH_LATENCY_102              FLASH_ACCTRL_WAITP_102WS
#define FLASH_LATENCY_103              FLASH_ACCTRL_WAITP_103WS
#define FLASH_LATENCY_104              FLASH_ACCTRL_WAITP_104WS
#define FLASH_LATENCY_105              FLASH_ACCTRL_WAITP_105WS
#define FLASH_LATENCY_106              FLASH_ACCTRL_WAITP_106WS
#define FLASH_LATENCY_107              FLASH_ACCTRL_WAITP_107WS
#define FLASH_LATENCY_108              FLASH_ACCTRL_WAITP_108WS
#define FLASH_LATENCY_109              FLASH_ACCTRL_WAITP_109WS
#define FLASH_LATENCY_110              FLASH_ACCTRL_WAITP_110WS
#define FLASH_LATENCY_111              FLASH_ACCTRL_WAITP_111WS
#define FLASH_LATENCY_112              FLASH_ACCTRL_WAITP_112WS
#define FLASH_LATENCY_113              FLASH_ACCTRL_WAITP_113WS
#define FLASH_LATENCY_114              FLASH_ACCTRL_WAITP_114WS
#define FLASH_LATENCY_115              FLASH_ACCTRL_WAITP_115WS
#define FLASH_LATENCY_116              FLASH_ACCTRL_WAITP_116WS
#define FLASH_LATENCY_117              FLASH_ACCTRL_WAITP_117WS
#define FLASH_LATENCY_118              FLASH_ACCTRL_WAITP_118WS
#define FLASH_LATENCY_119              FLASH_ACCTRL_WAITP_119WS
#define FLASH_LATENCY_120              FLASH_ACCTRL_WAITP_120WS
#define FLASH_LATENCY_121              FLASH_ACCTRL_WAITP_121WS
#define FLASH_LATENCY_122              FLASH_ACCTRL_WAITP_122WS
#define FLASH_LATENCY_123              FLASH_ACCTRL_WAITP_123WS
#define FLASH_LATENCY_124              FLASH_ACCTRL_WAITP_124WS
#define FLASH_LATENCY_125              FLASH_ACCTRL_WAITP_125WS
#define FLASH_LATENCY_126              FLASH_ACCTRL_WAITP_126WS
#define FLASH_LATENCY_127              FLASH_ACCTRL_WAITP_127WS
#else
#define FLASH_LATENCY_0                FLASH_CTRL_WS_0WS
#define FLASH_LATENCY_1                FLASH_CTRL_WS_1WS
#define FLASH_LATENCY_2                FLASH_CTRL_WS_2WS
#define FLASH_LATENCY_3                FLASH_CTRL_WS_3WS
#define FLASH_LATENCY_4                FLASH_CTRL_WS_4WS
#define FLASH_LATENCY_5                FLASH_CTRL_WS_5WS
#define FLASH_LATENCY_6                FLASH_CTRL_WS_6WS
#define FLASH_LATENCY_7                FLASH_CTRL_WS_7WS
#define FLASH_LATENCY_8                FLASH_CTRL_WS_8WS
#define FLASH_LATENCY_9                FLASH_CTRL_WS_9WS
#define FLASH_LATENCY_10               FLASH_CTRL_WS_10WS
#define FLASH_LATENCY_11               FLASH_CTRL_WS_11WS
#define FLASH_LATENCY_12               FLASH_CTRL_WS_12WS
#define FLASH_LATENCY_13               FLASH_CTRL_WS_13WS
#define FLASH_LATENCY_14               FLASH_CTRL_WS_14WS
#define FLASH_LATENCY_15               FLASH_CTRL_WS_15WS
#define FLASH_LATENCY_16               FLASH_CTRL_WS_16WS
#define FLASH_LATENCY_17               FLASH_CTRL_WS_17WS
#define FLASH_LATENCY_18               FLASH_CTRL_WS_18WS
#define FLASH_LATENCY_19               FLASH_CTRL_WS_19WS
#define FLASH_LATENCY_20               FLASH_CTRL_WS_20WS
#define FLASH_LATENCY_21               FLASH_CTRL_WS_21WS
#define FLASH_LATENCY_22               FLASH_CTRL_WS_22WS
#define FLASH_LATENCY_23               FLASH_CTRL_WS_23WS
#define FLASH_LATENCY_24               FLASH_CTRL_WS_24WS
#define FLASH_LATENCY_25               FLASH_CTRL_WS_25WS
#define FLASH_LATENCY_26               FLASH_CTRL_WS_26WS
#define FLASH_LATENCY_27               FLASH_CTRL_WS_27WS
#define FLASH_LATENCY_28               FLASH_CTRL_WS_28WS
#define FLASH_LATENCY_29               FLASH_CTRL_WS_29WS
#define FLASH_LATENCY_30               FLASH_CTRL_WS_30WS
#define FLASH_LATENCY_31               FLASH_CTRL_WS_31WS
#endif /* APM32F40xxx || APM32F41xxx | APM32F465xx || APM32F411xx */
/*--------------------------------------------------------------------------------------------------------------*/

/**
  * @}
  */

