betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_flash_ex.h
/*----------------------------------------- APM32F411xx-------------------------------------------*/
#if defined(APM32F411xx)
#define OB_PCROP_SECTOR_0        0x00000001U /*!< PC Read/Write protection of Sector0      */
#define OB_PCROP_SECTOR_1        0x00000002U /*!< PC Read/Write protection of Sector1      */
#define OB_PCROP_SECTOR_2        0x00000004U /*!< PC Read/Write protection of Sector2      */
#define OB_PCROP_SECTOR_3        0x00000008U /*!< PC Read/Write protection of Sector3      */
#define OB_PCROP_SECTOR_4        0x00000010U /*!< PC Read/Write protection of Sector4      */
#define OB_PCROP_SECTOR_5        0x00000020U /*!< PC Read/Write protection of Sector5      */
#define OB_PCROP_SECTOR_6        0x00000040U /*!< PC Read/Write protection of Sector6      */
#define OB_PCROP_SECTOR_7        0x00000080U /*!< PC Read/Write protection of Sector7      */
#define OB_PCROP_SECTOR_All      0x00000FFFU /*!< PC Read/Write protection of all Sectors  */
#endif /* APM32F411xx */
/*-----------------------------------------------------------------------------------------------------*/

/**
  * @}
  */

/** @defgroup  FLASHEx_Selection_Protection_Mode FLASH Selection Protection Mode
  * @{
  */
#if defined(APM32F411xx)
#define OB_PCROP_DESELECTED     ((uint8_t)0x00) /*!< Disabled PcROP, nWPRi bits used for Write Protection on sector i */
#define OB_PCROP_SELECTED       ((uint8_t)0x80) /*!< Enable PcROP, nWPRi bits used for PCRoP Protection on sector i   */
#endif /* APM32F411xx */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup FLASH_Exported_Macros FLASH Exported Macros
 *  @brief macros to control FLASH features
 *  @{
 */

#if defined(APM32F403xx) || defined(APM32F402xx)
/** @defgroup FLASH_Half_Cycle FLASH Half Cycle
 *  @brief macros to handle FLASH half cycle
 * @{
 */

/**
  * @brief  Enable the FLASH half cycle access.
  * @note   half cycle access can only be used with a low-frequency clock of less than
            8 MHz that can be obtained with the use of HSI or HSE but not of PLL.
  * @retval None
  */
#define __DAL_FLASH_HALF_CYCLE_ACCESS_ENABLE()  (FLASH->CTRL1 |= FLASH_CTRL1_HCAEN)

/**
  * @brief  Disable the FLASH half cycle access.
  * @note   half cycle access can only be used with a low-frequency clock of less than
            8 MHz that can be obtained with the use of HSI or HSE but not of PLL.
  * @retval None
  */
#define __DAL_FLASH_HALF_CYCLE_ACCESS_DISABLE() (FLASH->CTRL1 &= (~FLASH_CTRL1_HCAEN))

/**
  * @}
  */

#endif /* APM32F403xx || APM32F402xx */

#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/**
  * @brief  Set FLASH Prefetch Mode
  * @param  __MODE__: FLASH Prefetch Mode
  *                   FLASH_PREFETCH_MODE_DOUBLE_ACCESS: Prefetch triggered after two accesses to same cacheline
  *                   FLASH_PREFETCH_MODE_SINGLE_ACCESS: Prefetch triggered after cache/buffer is accessed
  * @retval None
  */
#define __DAL_FLASH_SET_PREFETCH_MODE(__MODE__) (FLASH->ACCTRL = (FLASH->ACCTRL & (~FLASH_ACCTRL_PREF_TIMING)) | (__MODE__))

/**
  * @brief  Enable the FLASH read interrupt.
  * @retval none
  */
#define __DAL_FLASH_READ_INT_ENABLE() (FLASH->ACCTRL |= FLASH_ACCTRL_RD_INT_EN)

/**
  * @brief  Disable the FLASH read interrupt.
  * @retval none
  */
#define __DAL_FLASH_READ_INT_DISABLE() (FLASH->ACCTRL &= (~FLASH_ACCTRL_RD_INT_EN))

/**
  * @brief  Set FLASH Read Interrupt Time
  * @param  __MODE__: FLASH Read Interrupt Time
  *                   FLASH_READ_INTERRUPT_FAST: Fast read interrupt time
  *                   FLASH_READ_INTERRUPT_SLOW: Slow read interrupt time
  * @retval None
  */
#define __DAL_FLASH_SET_TRC_MODE(__MODE__) (FLASH->ACCTRL = (FLASH->ACCTRL & (~FLASH_ACCTRL_RD_INT_TIMING)) | (__MODE__))

#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup FLASHEx_Exported_Functions
  * @{
  */

/** @addtogroup FLASHEx_Exported_Functions_Group1
  * @{
  */
/* Extension Program operation functions  *************************************/
DAL_StatusTypeDef DAL_FLASHEx_Erase(FLASH_EraseInitTypeDef *pEraseInit, uint32_t *SectorError);
DAL_StatusTypeDef DAL_FLASHEx_Erase_IT(FLASH_EraseInitTypeDef *pEraseInit);
DAL_StatusTypeDef DAL_FLASHEx_OBProgram(FLASH_OBProgramInitTypeDef *pOBInit);
void              DAL_FLASHEx_OBGetConfig(FLASH_OBProgramInitTypeDef *pOBInit);

#if defined(APM32F411xx)
DAL_StatusTypeDef DAL_FLASHEx_AdvOBProgram (FLASH_AdvOBProgramInitTypeDef *pAdvOBInit);
void              DAL_FLASHEx_AdvOBGetConfig(FLASH_AdvOBProgramInitTypeDef *pAdvOBInit);
DAL_StatusTypeDef DAL_FLASHEx_OB_SelectPCROP(void);
DAL_StatusTypeDef DAL_FLASHEx_OB_DeSelectPCROP(void);
#endif /* APM32F411xx */

#if defined (APM32F403xx) || defined (APM32F402xx)
DAL_StatusTypeDef DAL_FLASHEx_OBErase(void);
uint32_t          DAL_FLASHEx_OBGetUserData(uint32_t DATAAdress);
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/**
  * @}
  */
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup FLASHEx_Private_Constants FLASH Private Constants
  * @{
  */

/*--------------------------------------- APM32F40xxx/APM32F41xxx/APM32F465xx -------------------------------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define FLASH_SECTOR_TOTAL  12U
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/*--------------------------------- APM32F411xx -------------------------------------*/
#if defined(APM32F411xx)
#define FLASH_SECTOR_TOTAL  8U
#endif /* APM32F411xx */

/*--------------------------------- APM32F402/403xx -------------------------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
#define FLASH_SIZE_DATA_REGISTER  0x1FFFF7E0U
#define OBR_REG_INDEX                1U
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

